Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: ཕྱིན་ཆད་ཀྱང་ཁྱོད་ཉིད་དང་ལྷན་ཅིག་ཏུ་སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་མཆོད་པ་བྱེད་པར་གྱུར་ཅིག །
en: Noble sir, henceforth may we, accompanying you, worship the buddhas and the bodhisattvas!

source: ཁྱོད་དང་ལྷན་ཅིག་ཏུ་གནས་པར་གྱུར་ཅིག །
en: May we dwell with you!’ “

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྟག་པར་རབ་ཏུ་ངུ་བས། ཚོང་དཔོན་གྱི་བུ་མོ་དེ་དང་བུ་མོ་ལྔ་བརྒྱ་པོ་དེ་དག་ལ་འདི་སྐད་སྨྲས་སོ། །བུ་མོ་ཁྱོད་སྙིང་ནས་ངའི་བསམ་པ་དང་འཐུན་པར་བྱེད་ཅིང་། སྙིང་ནས་ང་ལ་ལུས་འབུལ་ན་ནི་ང་ཡང་ཁྱེད་ལེན་ཏོ།
en: Then the bodhisattva great being Sadāprarudita replied to that merchant’s daughter and those five hundred maidens, ‘Young women, if you are sincerely compatible with my aspirations and sincerely offer your bodies to me, I will indeed accept you.’ “

source: །བུ་མོ་དེ་དག་གིས་སྨྲས་པ། བདག་ཅག་ཁྱོད་ལ་སྙིང་ནས་བསམ་པ་དང་འཐུན་པར་བྱེད་ཅིང་། ཁྱོད་ཅི་དགོས་པ་བྱ་བའི་ཕྱིར་སྙིང་ནས་ལུས་འབུལ་ལོ། །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྟག་པར་རབ་ཏུ་ངུ་བས།
en: The young women replied, ‘We are sincerely compatible with your aspirations and sincerely offer our bodies to you, so that you may do as you will.’ “

source: ཚོང་དཔོན་གྱི་བུ་མོ་དེ་ལ་སྩོགས་པ་བུ་མོ་ལྔ་བརྒྱ་རྣམས་རྒྱན་ཐམས་ཅད་ཀྱིས་ཀླུབས། ཤིང་རྟ་ལྔ་བརྒྱ་པོ་དེ་རྣམས་ཀྱང་རྒྱན་གྱིས་བརྒྱན་ནས། ཐམས་ཅད་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཀྱིས་འཕགས་པ་ལ་ཕུལ་ཏེ། རིགས་ཀྱི་བུ་ཁྱོད་ལ་བུ་མོ་འདི་རྣམས་དང་། ཤིང་རྟ་ལྔ་བརྒྱ་པོ་འདི་རྣམས་ཡོངས་སུ་སྤྱད་པར་བྱ་བའི་ཕྱིར་དབུལ་ལོ།
en: Then the bodhisattva great being Sadāprarudita presented to the bodhisattva great being Dharmodgata those five hundred maidens, headed by the merchant’s daughter, embellished with all their ornaments, and their five hundred carriages, also adorned with ornaments, and said, ‘Noble sir, I offer these maidens and these five hundred carriages to you, so that you may enjoy them.’ “

source: །ཞེས་སྨྲས་སོ། །དེ་ནས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་རིགས་ཀྱི་བུ་དེ་ལ་རིགས་ཀྱི་བུ་ལེགས་སོ།
en: Then Śakra, mighty lord of the gods, applauded that noble son: ‘Excellent, noble son!

source: །ལེགས་སོ་ཞེས་ནས།
en: Excellent!’

source: ལེགས་པ་བྱིན་ཏེ། རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་གིས་དེ་ལྟར་བདོག་པ་ཐམས་ཅད་ཡོངས་སུ་གཏང་བར་བྱའོ།
en: And he continued, ‘Noble son, bodhisattva great beings should renounce all their possessions in that manner.

source: །གཏོང་བའི་སེམས་དེ་ལྟ་བུ་དག་གིས་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་འཚང་རྒྱའོ།
en: With such thoughts of renunciation bodhisattva great beings will swiftly attain manifest buddhahood in unsurpassed, complete enlightenment.

source: །ཆོས་སྨྲ་བ་ལ་དེ་ལྟར་མཆོད་པ་བྱས་ན། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་ཐབས་མཁས་པ་ཉན་ནུས་པར་འགྱུར་རོ།
en: If they make offerings in that manner to those who preach the Dharma, they will be able to hear the skill in means that is associated with the perfection of wisdom.

source: །སྔོན་གྱི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དེ་རྣམས་ཀྱིས་ཀྱང་། སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པའི་ཚེ། གཏོང་བ་དེ་ལྟ་བུ་ལ་གནས་ནས། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀུན་དུ་བསྒྲུབས།
en: Formerly when the tathāgatas, arhats, completely awakened buddhas of the past practiced the conduct of a bodhisattva, they maintained such renunciation and achieved unsurpassed, complete enlightenment.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་ཐབས་མཁས་པ་ཡང་ཡོངས་སུ་དྲིས་སོ།
en: They also asked questions about this skill in means that is associated with the perfection of wisdom.’ “

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཀྱིས་འཕགས་པས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྟག་པར་རབ་ཏུ་ངུ་བའི་དགེ་བའི་རྩ་བ་ཡོངས་སུ་རྫོགས་པར་བྱ་བའི་ཕྱིར། ཚོང་དཔོན་གྱི་བུ་མོ་ལ་སོགས་པ་བུ་མོ་ལྔ་བརྒྱ་པོ་དེ་རྣམས་དང་། ཤིང་རྟ་ལྔ་བརྒྱ་བླངས་སོ།
en: Then the bodhisattva great being Dharmodgata, in order to perfect Sadāprarudita’s roots of virtuous action, accepted those five hundred maidens, headed by the merchant’s daughter, and their five hundred carriages.

source: །བླངས་ནས་ཀྱང་རྟག་པར་རབ་ཏུ་ངུ་བའི་རིགས་ཀྱི་བུ་དེ་ཉིད་ལ་སླར་བྱིན་ནོ།
en: After accepting them, he [immediately] gave them back to that noble son, Sadāprarudita.

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཀྱིས་འཕགས་པ་སྟན་ལས་ལངས་ནས་བདག་གི་ཁྱིམ་དུ་སོང་ངོ་།
en: Then the bodhisattva great being Dharmodgata arose from his seat and went inside his house.

source: །ཉི་མ་ཡང་ནུབ་པར་གྱུར་ཏོ།
en: The sun also set. “

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྟག་པར་རབ་ཏུ་ངུ་བ་འདི་སྙམ་དུ་གྱུར་ཏོ། །བདག་ཆོས་འདོད་པའི་ཕྱིར་འོངས་ལ། འདུག་པ་འམ། ཉལ་བ་ནི་ལེགས་པ་མ་ཡིན་ལ། བདག་གི་ཆ་མ་ཡིན་གྱིས།
en: The bodhisattva great being Sadāprarudita then had the following thought: ‘It would not be proper and it would not be fitting for me, having come here out of desire for the Dharma, to sit or to lie down.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཀྱིས་འཕགས་པ་བདག་གི་ཁྱིམ་ནས་ཆོས་འཆད་པའི་ཕྱིར་མ་བྱུང་གི་བར་དུ་འགྲེང་བ་འམ། འཆག་པའི་སྤྱོད་ལམ་གཉིས་ཀྱིས་བསྡད་དོ་སྙམ་མོ།
en: I will remain either standing or walking, until the bodhisattva great being Dharmodgata comes out of his house to teach the Dharma.’ {

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ། །ཆོས་ཀྱིས་འཕགས་པ་ལོ་བདུན་དུ་སྙོམས་པར་ཞུགས་པ་གཅིག་ལ་གནས་ཏེ། བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་ཐབས་མཁས་པ་ལས་བྱུང་བ་སྟོང་ཕྲག་གྲངས་མེད་ཚད་མེད་པ་ལས་གནས་པར་གྱུར་ཏོ།
en: Va.257} “The bodhisattva great being Dharmodgata then remained for seven years in a single meditative absorption, and he maintained the countless and immeasurable thousands of meditative stabilities of bodhisattvas, which originate from the skill in means associated with the perfection of wisdom.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྟག་པར་རབ་ཏུ་ངུ་བ་ཡང་ལོ་བདུན་དུ་འདོད་པའི་རྣམ་པར་རྟོག་པ་མི་སྐྱེད། གནོད་སེམས་ཀྱི་རྣམ་པར་རྟོག་པ་དང་། འཚེ་བའི་རྣམ་པར་རྟོག་པ་དང་། རོ་ལ་ཆགས་པ་མི་སྐྱེད་ཀྱི།
en: For seven years, also, the bodhisattva great being Sadāprarudita never cultivated thoughts of desire, and he never cultivated thoughts of malice, thoughts of harm, or attachment to tastes.

source: གཞན་དུ་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཀྱིས་འཕགས་པའི་རིགས་ཀྱི་བུ་དེ་གང་ལ་འདུག་ནས་ཆོས་འཆད་པའི་ཆོས་ཀྱི་སྟན་བཏིང་བར་བྱ་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཀྱིས་འཕགས་པ་འདི་ལངས་པ་ཇི་ཙམ་ན་མཐོང་སྙམ་པ་དང་།
en: Rather, he thought, ‘How long will it be until we see this bodhisattva great being Dharmodgata arise [from his meditations], so that we may spread out a teaching seat on which that noble sir, the bodhisattva great being Dharmodgata, will sit and teach the Dharma?’

source: ས་ཕྱོགས་གང་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཀྱིས་འཕགས་པ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་ཐབས་མཁས་པ་འཆད་པའི་ས་ཕྱོགས་དེ་ཡང་ཕྱག་དར་བྱས་ཤིང་ཆག་ཆག་གིས་བཏབ་ལ། མེ་ཏོག་སྣ་ཚོགས་ཀྱིས་ཀུན་དུ་གཏོར་ཏོ་སྙམ་པ་ལས་བསམ་པ་གཞན་མེད་དོ།
en: And he had no other wish apart from thinking, ‘After sweeping and sprinkling the ground where the bodhisattva great being Dharmodgata will explain the skill in means associated with the perfection of wisdom, I will scatter various flowers upon it.’

source: །ཚོང་དཔོན་གྱི་བུ་མོ་ལ་སྩོགས་པ་བུ་མོ་ལྔ་བརྒྱ་པོ་དེ་རྣམས་ཀྱང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྟག་པར་རབ་ཏུ་ངུ་བའི་རྗེས་སུ་སློབ་ཅིང་། སྤྱོད་ལམ་གཉིས་པོ་དེ་ཉིད་ཀྱིས་སྡོད་ཅིང་འཁོད་དོ།
en: The merchant’s daughter with her five hundred maidens also trained under the bodhisattva great being Sadāprarudita and remained there in those same two modes of conduct [that is to say, of standing and walking].

source: །བྱ་བ་ཐམས་ཅད་ཀྱང་དེ་དང་རྗེས་སུ་འཐུན་པར་བྱེད་དོ།
en: In all their activities they indeed imitated him. “

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཀྱིས་འཕགས་པ་ཞག་བདུན་ན་ཏིང་ངེ་འཛིན་དེ་ལས་ལྡང་སྟེ། ལངས་ནས་ཀྱང་གྲོང་ཁྱེར་གྱི་དབུས་སུ་ཆོས་འཆད་དོ། །ཞེས་ཟེར་བའི་སྒྲ་ནམ་མཁའ་ལས་བྱུང་བ།
en: Then one day a voice emerged from the sky, saying that in seven days the bodhisattva great being Dharmodgata would rise from his meditative stability, and, having arisen, would teach the Dharma in the middle of the city.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྟག་པར་རབ་ཏུ་ངུ་བས་ཐོས་སོ། །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྟག་པར་རབ་ཏུ་ངུ་བས་སྒྲ་དེ་ཐོས་ནས། དགའ་མགུ་ཡིད་རངས་རབ་ཏུ་དགའ་ཞིང་ཡིད་བདེ་བ་སྐྱེས་པར་གྱུར་ནས།
en: The bodhisattva great being Sadāprarudita heard that voice, and having heard it, he became elated, joyful, delighted, and contented.

source: ཚོང་དཔོན་གྱི་བུ་མོ་ལ་སོགས་པ་བུ་མོ་ལྔ་བརྒྱ་པོ་རྣམས་དང་ལྷན་ཅིག་ཏུ་ས་ཕྱོགས་དེ་བྱི་དོར་བྱས་ནས། ཆོས་ཀྱི་སྟན་རིན་པོ་ཆེ་སྣ་བདུན་ལས་བྱས་པ་ཡང་བཏིང་ངོ་།
en: Together with the merchant’s daughter and her five hundred maidens he swept that ground and spread out a teaching seat made of the seven precious materials.

source: །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་མོ་ལ་སྩོགས་པ་བུ་མོ་ལྔ་བརྒྱ་པོ་ཐམས་ཅད་ཀྱིས་བདག་ཅག་གི་བླ་གོས་ལུས་ལས་ཕུད་དེ་སྟན་གང་ལ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཀྱིས་འཕགས་པ་འདུག་སྟེ། ཆོས་འཆད་པའི་ཆོས་ཀྱི་སྟན་དེར་བླ་གོས་ལྔ་བརྒྱ་སྟན་དུ་བཏིང་ངོ་། །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྟག་པར་རབ་ཏུ་ངུ་བ།
en: Then the merchant’s daughter and all her five hundred maidens took off their upper robes and spread out those five hundred upper robes upon the doctrinal seat as a cushion where the bodhisattva great being Dharmodgata would sit and teach the Dharma.

source: ས་ཕྱོགས་དེ་ཆག་ཆག་གདབ་པའི་ཕྱིར་ཁོ་ར་ཁོར་ཡུག་ཏུ་ཆུ་བཙལ་ན། ས་ཕྱོགས་དེ་ཆག་ཆག་གདབ་པའི་ཆུ་བདུད་སྡིག་ཏོ་ཅན་གྱིས་ཅི་ནས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྟག་པར་རབ་ཏུ་ངུ་བ་ཆུ་མ་རྙེད་ནས། སེམས་ལ་སྡུག་བསྔལ་བ་དང་། ཡིད་མི་དགའ་བ་དང་། སེམས་གཞན་དུ་གྱུར་ཏེ། དེའི་དགེ་བའི་རྩ་བ་མེད་པར་གྱུར་ཅིང་།
en: Then, when the bodhisattva great being Sadāprarudita searched all around for water to sprinkle on that ground, he did not find any water because the evil Māra had concealed the water for sprinkling on that ground, so that there was every chance he would be saddened, displeased, and change his mind, eliminating his roots of virtuous action and causing those offerings also to deteriorate.

source: མཆོད་པ་དེ་ཡང་ངན་པར་འགྱུར་བ་དེ་ལྟ་བུར་བྱ་བའི་ཕྱིར། ཆུ་དེ་མེད་པ་བྱས་པས་ཆུ་མ་རྙེད་པར་གྱུར་ཏོ། །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྟག་པར་རབ་ཏུ་ངུ་བ་འདི་སྙམ་དུ་གྱུར་ཏོ། །འོ་ན་བདག་གི་ལུས་ཕུག་སྟེ། ས་ཕྱོགས་འདི་ཁྲག་གིས་ཆག་ཆག་གདབ་བོ།
en: But then the bodhisattva great being Sadāprarudita had the following thought: ‘Well then, I will pierce my own body, and sprinkle this ground with blood.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། ས་ཕྱོགས་འདི་ནི་རྡུལ་ཆེ་སྟེ། རྡུལ་དེ་དག་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཀྱིས་འཕགས་པའི་ལུས་ལ་མ་རུང་བར་གྱུར་ན། བདག་གི་ལུས་ངེས་པར་འཇིག་པར་འགྱུར་བ་འདིས་ཅི་ཞིག་བྱ།
en: If you ask why, since on this ground there is much dust that is unsuitable for the body of the bodhisattva great being Dharmodgata, what else should I do with this body which will certainly perish? {

source: བདག་གི་ལུས་དོན་མེད་པར་ཆུད་ཟོས་པ་བས་འདི་ལྟར་བྱས་ན་བདག་གི་ལུས་མེད་པར་གྱུར་ཀྱང་བླའོ།
en: Va.258} It is better that my body should be destroyed by such an action rather than having my body wasted ineffectually.

source: །བདག་གི་ལུས་སྟོང་ཕྲག་དུ་མ་འདོད་པའི་རྒྱུ་དང་། འདོད་པའི་གཞི་དང་། འདོད་པའི་མཚན་མར་འཁོར་བ་ན་ཡང་དང་ཡང་དུ་འཁོར་བའི་ཚེ། ཆུད་ཟོས་ཀྱི་གནས་འདི་ལྟ་བུ་དག་ཏུ་ནི་མ་སོང་ངོ་།
en: Many thousands of my bodies have roamed again and again in cyclic existence due to attachment, and on the basis of attachment and as signs of attachment, I did not [have this opportunity] among such wasted circumstances.’

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྟག་པར་རབ་ཏུ་ངུ་བ་མཚོན་རྣོན་པོ་ཞིག་ཐོགས་ཏེ་བདག་གི་ལུས་ཀུན་ཕུག་ནས། ས་ཕྱོགས་དེ་ཀུན་བདག་གི་ཁྲག་གིས་ཆག་ཆག་བཏབ་བོ།
en: Then the bodhisattva great being Sadāprarudita took a sharp weapon, pierced his entire body, and sprinkled that ground entirely with his own blood.

source: །ཚོང་དཔོན་གྱི་བུ་མོ་ལ་སོགས་པ་བུ་མོ་ལྔ་བརྒྱ་པོ་དེ་རྣམས་ཀྱང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྟག་པར་རབ་ཏུ་ངུ་བའི་རྗེས་སུ་སློབ་པས། ཐམས་ཅད་ཀྱིས་མཚོན་རྣོན་པོ་བླངས་ནས། བདག་ཅག་གི་ལུས་ཕུག་སྟེ། ས་ཕྱོགས་དེ་བདག་ཅག་གི་ཁྲག་གིས་ཆག་ཆག་བཏབ་བོ།
en: The merchant’s daughter with her five hundred maidens, training under the bodhisattva great being Sadāprarudita, also took sharp weapons, pierced their own bodies, and sprinkled their blood on that ground.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྟག་པར་རབ་ཏུ་ངུ་བ་དང་། བུ་མོ་དེ་རྣམས་ཀྱང་སེམས་གཞན་དུ་མ་གྱུར་ཏེ། བདུད་སྡིག་ཏོ་ཅན་གྱིས་དགེ་བའི་ཕྱོགས་ལ་བར་ཆད་བྱ་བའི་སྐབས་རྙེད་པར་ཡང་མ་གྱུར་ཏོ།
en: Neither the bodhisattva great being Sadāprarudita nor those maidens had changed their minds, and Evil Māra had been able to find no opportunity to obstruct their virtuous approach. “

source: །དེ་ནས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་འདི་སྙམ་དུ་གྱུར་ཏོ། །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྟག་པར་རབ་ཏུ་ངུ་བ་འདི་དེ་ལྟར་ཆོས་འདོད་པ་དང་། དེ་ལྟར་ཡི་དམ་ལ་བརྟན་པ་དང་། གོ་ཆ་ཆེན་པོ་བགོས་པ་དང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་ཕྱིར་ལུས་དང་སྲོག་ལ་མི་ལྟ་བ་དང་།
en: Then Śakra, mighty lord of the gods, had the following thought: ‘It is wonderful how this bodhisattva great being Sadāprarudita desires the Dharma, is steadfast in his commitments, has donned the great armor, disregards his body and life for the sake of unsurpassed, complete enlightenment, and resolves, once he has attained consummate buddhahood in unsurpassed, complete enlightenment, to liberate beings through his higher aspiration from the inestimable sufferings of cyclic existence!’

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས། ལྷག་པའི་བསམ་པས་འདི་ལྟར་སེམས་ཅན་རྣམས་འཁོར་བའི་སྡུག་བསྔལ་དཔག་ཏུ་མེད་པ་ལས་ཡོངས་སུ་ཐར་བར་བྱ་བར་སེམས་པ་དེ་ངོ་མཚར་ཆེའོ། །དེ་ནས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་ཁྲག་དེ་ཐམས་ཅད་ལྷའི་ཙན་དན་གྱི་ཆུར་བྱིན་གྱིས་བརླབས་སོ། །ས་ཕྱོགས་དེ་ཁོ་ར་ཁོར་ཡུག་ཀྱང་། ལྷའི་ཙན་དན་གྱི་ཆུའི་དྲི་བསམ་གྱིས་མི་ཁྱབ་པ་དཔག་ཚད་བརྒྱའི་བར་དུ་བསང་བར་བྱས་སོ།
en: Śakra, mighty lord of the gods, then transformed all that blood into divine sandalwood water, and all around that ground, as far as a hundred yojanas, an inconceivable fragrance of divine sandalwood wafted.

source: །དེ་ནས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྟག་པར་རབ་ཏུ་ངུ་བ་ལ་འདི་སྐད་སྨྲས་སོ། །རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་བརྩོན་འགྲུས་བསམ་གྱིས་མི་ཁྱབ་པ་དང་། ཁྱོད་ཆོས་འདོད་པ་དང་། ཆོས་ཚོལ་བ་བླ་ན་མེད་པ་དེ་ལེགས་སོ།
en: Then Śakra, mighty lord of the gods, said to the bodhisattva great being Sadāprarudita, ‘Noble son, you are unsurpassed for inconceivable perseverance, your desire for the Dharma, and your search for the Dharma.

source: །རིགས་ཀྱི་བུ་སྔོན་གྱི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཀྱིས་ཀྱང་ལྷག་པའི་བསམ་པ་དེ་ལྟ་བུ་དང་། བརྩོན་འགྲུས་དེ་ལྟ་བུ་དང་། ཆོས་འདོད་པ་དེ་ལྟ་བུས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་བསྒྲུབས་སོ།
en: Noble son, the tathāgatas, arhats, completely awakened buddhas of the past also attained unsurpassed, complete enlightenment through such higher aspirations, such perseverance, and such desire for the Dharma.’ “

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྟག་པར་རབ་ཏུ་ངུ་བ་འདི་སྙམ་དུ་གྱུར་ཏོ། །བདག་གིས་འཕགས་པ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཀྱིས་འཕགས་པའི་ཆོས་ཀྱི་སྟན་ནི་བཏིང་ཟིན། ས་ཕྱོགས་འདི་ཡང་ཆག་ཆག་བཏབ་ཅིང་ཕྱག་དར་བྱས་ཟིན་ན། ས་ཕྱོགས་འདི་དག་ཏུ་མེ་ཏོག་གིས་གཏོར་བ་དང་། འཕགས་པ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཀྱིས་འཕགས་པ་ཆོས་འཆད་པ་ལ་གཏོར་བའི་མེ་ཏོག་བདག་གིས་ག་ལས་རྙེད་སྙམ་པ་དང་།
en: Then the bodhisattva great being Sadāprarudita had the following thought: ‘Since I have spread out the teaching seat for the sublime bodhisattva great being Dharmodgata, and sprinkled and swept this ground as well, where shall I find flowers to scatter on this ground and to scatter over the sublime bodhisattva great being Dharmodgata when he teaches the Dharma?’ “

source: དེ་ནས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྟག་པར་རབ་ཏུ་ངུ་བ་ལ་འདི་སྐད་སྨྲས་སོ། །རིགས་ཀྱི་བུ་ལྷའི་མེ་ཏོག་མན་དཱ་ར་བ་འདི་རྣམས་ཁྱེར་ལ། འདི་དག་གིས་ས་ཕྱོགས་འདི་ཁྱོད་ཀྱིས་མེ་ཏོག་གིས་གཏོར་ཅིག།
en: Thereupon, Śakra, mighty lord of the gods, said to the bodhisattva great being Sadāprarudita, ‘Noble son, take these divine coral flowers and you may scatter this ground with flowers!

source: འཕགས་པ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཀྱིས་འཕགས་པ་ཆོས་ཀྱི་སྟན་ལ་འདུག་ཅིང་། ཆོས་འཆད་པ་ལ་ཡང་གཏོར་ཅིག་ཅེས་ནས།
en: You may also scatter them over the teaching seat on which the sublime bodhisattva great being Dharmodgata will sit and teach the Dharma!’

source: དེས་ལྷའི་མེ་ཏོག་མན་དཱ་ར་བ་ཁལ་བཞི་བརྒྱ་དེ་ལ་བྱིན་ནོ།
en: And he presented him with four hundred loads of divine coral flowers.

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྟག་པར་རབ་ཏུ་ངུ་བས་མེ་ཏོག་དེ་དག་བླངས་ནས། མེ་ཏོག་དེ་དག་ཁ་ཅིག་ནི་ས་ཕྱོགས་དེར་གཏོར།
en: The bodhisattva great being Sadāprarudita thereupon accepted those flowers, and scattered some of those flowers on the ground.

source: མེ་ཏོག་ཁ་ཅིག་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཀྱིས་འཕགས་པ་ལ་མཆོད་པའི་ཕྱིར་བཞག་གོ །
en: He kept some flowers to offer to the bodhisattva great being Dharmodgata. “

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཀྱིས་འཕགས་པ་ལོ་བདུན་ལོན་པ་དང་། ཏིང་ངེ་འཛིན་དེ་ལས་ལངས་ནས། ཆོས་ཀྱི་སྟན་གང་ན་འདུག་པ་དེར་སོང་ནས། སྟན་བཏིང་བ་ལ་འདུག་སྟེ། འཁོར་བརྒྱ་སྟོང་དུ་མས་ཡོངས་སུ་བསྐོར།
en: Then when seven years had passed, the bodhisattva great being Dharmodgata arose from his meditative stability, and went to that place where the teaching seat had been laid out, and sat down, surrounded and accompanied by an assembly of many hundred thousands, and he taught the perfection of wisdom. {

source: མདུན་དུ་བྱས་ནས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འཆད་དོ། །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྟག་པར་རབ་ཏུ་ངུ་བ་ཚོང་དཔོན་གྱི་བུ་མོ་ལ་སོགས་པ་བུ་མོ་ལྔ་བརྒྱ་དང་བཅས་པས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཀྱིས་འཕགས་པ་ལ་མེ་ཏོག་གིས་མཆོད་པ་བྱས་སོ།
en: Va.259} Then the bodhisattva great being Sadāprarudita and the merchant’s daughter, together with the five hundred maidens, offered flowers to the bodhisattva great being Dharmodgata.

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྟག་པར་རབ་ཏུ་ངུ་བས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཀྱིས་འཕགས་པ་མཐོང་ནས་དཔེར་ན་དགེ་སློང་བསམ་གཏན་དང་པོ་ལ་སྙོམས་པར་ཞུགས་པ་ཡིད་ལ་བྱེད་པ་རྩེ་གཅིག་ཏུ་གྱུར་པ་དེ་ལྟ་བུའི་བདེ་བ་རབ་ཏུ་ཐོབ་པར་གྱུར།
en: When the great bodhisattva Sadāprarudita saw the bodhisattva great being Dharmodgata, he attained the kind of bliss that is experienced when a monk with one-pointed attention is absorbed in the first meditative concentration. “

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཀྱིས་འཕགས་པ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་ཆོས་འཆད་པ་ནི་འདི་ལྟ་སྟེ། ཆོས་ཐམས་ཅད་མཉམ་པ་ཉིད་པས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མཉམ་པ་ཉིད་དོ།
en: The explanation of the Dharma of the perfection of wisdom imparted to him by the bodhisattva great being Dharmodgata was as follows: “ ‘One should know that the perfection of wisdom is (1) sameness owing to the sameness of all phenomena.

source: །ཆོས་ཐམས་ཅད་རྣམ་པར་དབེན་པས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་རྣམ་པར་དབེན་ནོ།
en: The perfection of wisdom is (2) voidness owing to the voidness of all phenomena.

source: །ཆོས་ཐམས་ཅད་མི་གཡོ་བ་ཉིད་ཀྱི་ཕྱིར། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མི་གཡོ་བ་ཉིད་དོ།
en: The perfection of wisdom is (3) motionlessness owing to the motionlessness of all phenomena.

source: །ཆོས་ཐམས་ཅད་སེམས་པ་མེད་པའི་ཕྱིར། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་སེམས་པ་མེད་པ་ཉིད་དོ།
en: The perfection of wisdom is (4) the absence of mentation owing to the absence of mentation in all phenomena.

source: །ཆོས་ཐམས་ཅད་མནན་པ་མེད་པའི་ཕྱིར། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མནན་པ་མེད་པ་ཉིད་དོ།
en: The perfection of wisdom is (5) imperturbability owing to the imperturbability of all phenomena.

source: །ཆོས་ཐམས་ཅད་རོ་གཅིག་པའི་ཕྱིར། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་རོ་གཅིག་པ་ཉིད་དོ།
en: The perfection of wisdom is (6) of common savor owing to the common savor of all phenomena.

source: །ཆོས་ཐམས་ཅད་མཐའ་ཡས་པའི་ཕྱིར། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་མཐའ་ཡས་པ་ཉིད་དོ།
en: The perfection of wisdom is (7) infinitude owing to the infinitude of all phenomena.

source: །ཆོས་ཐམས་ཅད་སྐྱེ་བ་མེད་པའི་ཕྱིར། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྐྱེ་བ་མེད་པ་ཉིད་དོ།
en: The perfection of wisdom is (8) nonarising owing to the nonarising of all phenomena.

source: །ཆོས་ཐམས་ཅད་འགག་པ་མེད་པའི་ཕྱིར། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འགག་པ་མེད་པ་ཉིད་དོ།
en: The perfection of wisdom is (9) nonceasing owing to the nonceasing of all phenomena.

source: །ནམ་མཁའ་མཐའ་ཡས་པའི་ཕྱིར། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མཐའ་ཡས་པ་ཉིད་དོ།
en: The perfection of wisdom is (10) infinity owing to the infinity of space.

source: །རྒྱ་མཚོ་མཐའ་ཡས་པའི་ཕྱིར། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མཐའ་ཡས་པ་ཉིད་དོ།
en: The perfection of wisdom is (11) infinity owing to the infinity of the oceans.

source: །རི་རབ་ལྟ་བུར་རྣམ་པ་སྣ་ཚོགས་པའི་ཕྱིར། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་རྣམ་པ་སྣ་ཚོགས་པ་ཉིད་དོ།
en: The perfection of wisdom is (12) multifaceted owing to multifacetedness like that of Mount Sumeru.

source: །ནམ་མཁའ་ལྟར་རྣམ་པར་མི་རྟོག་པའི་ཕྱིར། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་རྣམ་པར་མི་རྟོག་པ་ཉིད་དོ།
en: The perfection of wisdom is (13) nonconceptualization owing to nonconceptualization like that of the sky.

source: །གཟུགས་མཐའ་ཡས་པའི་ཕྱིར། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མཐའ་ཡས་པ་ཉིད་དོ།
en: The perfection of wisdom is (14) boundlessness owing to the boundlessness of physical forms.

source: །དེ་བཞིན་དུ་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་མཐའ་ཡས་པའི་ཕྱིར། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མཐའ་ཡས་པ་ཉིད་དོ།
en: Similarly, the perfection of wisdom is (15) boundlessness owing to the boundlessness of feelings, perceptions, formative predispositions, and consciousness.

source: །སའི་ཁམས་མཐའ་ཡས་པའི་ཕྱིར། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མཐའ་ཡས་པ་ཉིད་དོ།
en: The perfection of wisdom is (16) boundlessness owing to the boundlessness of the earth element.

source: །དེ་བཞིན་དུ་ཆུའི་ཁམས་དང་། མེའི་ཁམས་དང་། རླུང་གི་ཁམས་མཐའ་ཡས་པའི་ཕྱིར། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མཐའ་ཡས་པ་ཉིད་དོ།
en: Similarly, the perfection of wisdom is (17) boundlessness owing to the boundlessness of the water element, the fire element, and the wind element.

source: །ནམ་མཁའི་དབྱིངས་མཐའ་ཡས་པའི་ཕྱིར། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མཐའ་ཡས་པ་ཉིད་དོ།
en: The perfection of wisdom is (18) boundlessness owing to the boundlessness of the space element.

source: །རྡོ་རྗེ་ལྟ་བུར་ཆོས་ཐམས་ཅད་མཉམ་པ་ཉིད་དུ་གྱུར་པའི་ཕྱིར། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མཉམ་པ་ཉིད་དོ།
en: The perfection of wisdom is (19) sameness owing to the vajra-likesameness of all phenomena.

source: །ཆོས་ཐམས་ཅད་འཇིག་པ་མེད་པའི་ཕྱིར། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འཇིག་པ་མེད་པ་ཉིད་དོ།
en: The perfection of wisdom is (20) irreducibility owing to the irreducibility of all phenomena.

source: །ཆོས་ཐམས་ཅད་དམིགས་སུ་མེད་པའི་ཕྱིར། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དམིགས་སུ་མེད་པ་ཉིད་དོ།
en: The perfection of wisdom is (21) nonapprehensibility owing to the nonapprehensibility of all phenomena.

source: །ཆོས་ཐམས་ཅད་རྣམ་པར་འབྱེད་པ་མཉམ་པ་ཉིད་ཀྱི་ཕྱིར། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མཉམ་པ་ཉིད་དོ།
en: The perfection of wisdom is (22) nondifferentiation owing to the nondifferentiation of all phenomena.

source: །ཆོས་ཐམས་ཅད་གཡོ་བ་མེད་པའི་ཕྱིར། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་གཡོ་བ་མེད་པ་ཉིད་དོ།
en: The perfection of wisdom is (23) inactivity owing to the inactivity of all phenomena.

source: །ཆོས་ཐམས་ཅད་བསམ་གྱིས་མི་ཁྱབ་པའི་ཕྱིར། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་བསམ་གྱིས་མི་ཁྱབ་པ་ཉིད་དུ་རིག་པར་བྱའོ།
en: The perfection of wisdom is (24) inconceivability owing to the inconceivability of all phenomena.’ “
